logs/Test-1/Google/oltp_insert.log
sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           13034
        other:                           0
        total:                           13034
    transactions:                        13034  (1302.41 per sec.)
    queries:                             13034  (1302.41 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0059s
    total number of events:              13034

Latency (ms):
         min:                                  3.33
         avg:                                  6.14
         max:                                 40.55
         95th percentile:                      7.43
         sum:                              79987.06

Threads fairness:
    events (avg/stddev):           1629.2500/2.90
    execution time (avg/stddev):   9.9984/0.00

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           23918
        other:                           0
        total:                           23918
    transactions:                        23918  (2390.01 per sec.)
    queries:                             23918  (2390.01 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0058s
    total number of events:              23918

Latency (ms):
         min:                                  3.25
         avg:                                  6.69
         max:                                 39.03
         95th percentile:                      8.90
         sum:                             159967.58

Threads fairness:
    events (avg/stddev):           1494.8750/30.53
    execution time (avg/stddev):   9.9980/0.00

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           37947
        other:                           0
        total:                           37947
    transactions:                        37947  (3790.72 per sec.)
    queries:                             37947  (3790.72 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0088s
    total number of events:              37947

Latency (ms):
         min:                                  3.32
         avg:                                  8.43
         max:                                131.94
         95th percentile:                     12.08
         sum:                             320033.78

Threads fairness:
    events (avg/stddev):           1185.8438/45.63
    execution time (avg/stddev):   10.0011/0.00

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           45936
        other:                           0
        total:                           45936
    transactions:                        45936  (4587.18 per sec.)
    queries:                             45936  (4587.18 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0124s
    total number of events:              45936

Latency (ms):
         min:                                  4.79
         avg:                                 13.94
         max:                                128.05
         95th percentile:                     20.74
         sum:                             640199.78

Threads fairness:
    events (avg/stddev):           717.7500/27.52
    execution time (avg/stddev):   10.0031/0.00

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           45612
        other:                           0
        total:                           45612
    transactions:                        45612  (4530.93 per sec.)
    queries:                             45612  (4530.93 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0651s
    total number of events:              45612

Latency (ms):
         min:                                  5.68
         avg:                                 28.17
         max:                                138.10
         95th percentile:                     44.17
         sum:                            1284687.48

Threads fairness:
    events (avg/stddev):           356.3438/5.06
    execution time (avg/stddev):   10.0366/0.02

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 256
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           45575
        other:                           0
        total:                           45575
    transactions:                        45575  (4537.47 per sec.)
    queries:                             45575  (4537.47 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0423s
    total number of events:              45575

Latency (ms):
         min:                                  5.05
         avg:                                 56.22
         max:                                194.73
         95th percentile:                     82.96
         sum:                            2562438.04

Threads fairness:
    events (avg/stddev):           178.0273/2.39
    execution time (avg/stddev):   10.0095/0.01

sysbench 1.0.12 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 512
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           39120
        other:                           0
        total:                           39120
    transactions:                        39120  (3823.62 per sec.)
    queries:                             39120  (3823.62 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.2291s
    total number of events:              39120

Latency (ms):
         min:                                 17.75
         avg:                                132.06
         max:                                593.61
         95th percentile:                    196.89
         sum:                            5166251.86

Threads fairness:
    events (avg/stddev):           76.4062/1.49
    execution time (avg/stddev):   10.0903/0.02